tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "sdkman/tap"

# Just me?
# brew "shureplus-motiv"
# brew "elgato-camera-hub"

# Installing fonts
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-raleway"

# Apps
cask "discord" # Chat
cask "whatsapp" # Chat
cask "spotify" # Gotta have music
cask "1password" # Password manager
cask "bitwarden" # Password manager (yes, I use two)
cask "cron" # Better calendar
cask "obsidian" # Better notes
cask "react-native-debugger" # React Native debugging
cask "google-chrome" # Better browser
cask "figma" # Design
cask "bruno" # API testing
cask "visual-studio-code"
cask "iterm2" # Better terminal
cask "slack" # Team chat
cask "miro" # Whiteboard
cask "dbeaver-community" # Postgres GUI
cask "malwarebytes" # Malware protection
cask "raycast" # Better spotlight

# Binaries
brew "coreutils" # Those that come with macOS are outdated
brew "bat" # Better cat
brew "watchman" # File watching (avoid `EMFILE: too many open files` error`)
brew "wget" # Downloading
brew "boost" # C++ libraries
brew "btop" # Better top
brew "corepack" # Better package manager
brew "jq" # JSON parsing
brew "git" # Git
brew "gitui" # Git UI
brew "libpq" # Postgres
brew "pigz" # Parallel gzip
brew "neovim" # Better vim
brew "awscli" # AWS CLI
brew "starship" # Better shell prompt
brew "sdkman/tap/sdkman-cli" # Java JDK + SDK management
brew "terminal-notifier" # Notifications

# Development
brew "scrcpy" # Android screen mirroring
brew "docker" # Containers
brew "python@3.11" # Python
brew "volta" # Node version manager

# App Store
# mas "WireGuard", id: 1451685025
